** 1.3
Define a procedure that take three numbers as arguments and returns the sum of 
the squares of the two larger numbers.
#+begin_src scheme
  (define (square-sum-large-two a b c)
    (define (square-sum x y)
      (+ (* x x) (* y y)))
    (cond ((and (< c a) (< c b)) (square-sum a b))
          ((and (< a b) (< a c)) (square-sum b c))
          ((and (< b c) (< b a)) (square-sum a c))
          ((= a b) (square-sum b c))
          ((= a c) (square-sum a b))
          ((= b c) (square-sum a b))
          ))

  (square-sum-large-two 3 3 3)
#+end_src

#+RESULTS:
: 18
*** How floating-point numbers work
The idea is to compose a number of two main parts:
- A *significand* that contains the number's digits. Negative significands represent negative numbers.
- An *exponent* that says where the decimal (or binary) point is placed relative to the beginning of
  the significand. Negative exponents represent numbers that are very small (i.e. close to zero).
Such a format satisfies all the requirements:
+ It can represent numbers at wildly different magnitudes (limited by the length of the exponent)
+ It provides the same relative accuracy at all magnitudes (limited by the length of the significand)
+ It allows calculations across magnitudes: multiplying a very large and a very small number preserves 
  the accuracy of both in the result.

Decimal floating-point numbers usually take the form of a scientific notation with an explicit point
always between the 1st and 2nd digits.

Implementing it  another way:
#+begin_src scheme
  (define (sqrt x)
    (define tolerance 0.01) ;; when changed ratio is less than 1%
    (define (average a b) (/ (+ a b) 2))
    (define (good-enough? old-guess new-guess)
      (< (/ (abs (- old-guess new-guess)) ;; if the changed ration is smaller than tolerance
            old-guess)
         tolerance))
    (define (improve guess) ;; improve the guess
      (average (/ x guess) guess))
    (define (sqrt-iter guess) ;; iteration
      (if (good-enough? guess (improve guess)) ;; if further improving only changes a small ratio
          guess
          (sqrt-iter (improve guess))))
    (sqrt-iter 1.0))
(sqrt 3)
#+end_src

#+RESULTS:
: 1.7321428571428572
** 1.8
Replace the approximation of the square root procedure with:
$$
\frac{x/y^2 + 2y}{3}
$$
#+begin_src scheme
  (define (cubert x)
    (define tolerance 0.0001)
    (define good-enough?
      (lambda (guess)
        (< (abs (- (* guess guess guess)
                   x))
           tolerance)))
    (define improve
      (lambda (y)
        (/ (+ (/ x (* y y))
              (* 2 y))
           3)))
    (define cbrt-iter
      (lambda (guess)
        (if (good-enough? guess)
            guess
            (cbrt-iter (improve guess)))))
    (cbrt-iter 1.0))

(cubert 23)
#+end_src

#+RESULTS:
: 2.8438670109096598
** 1.10
The following procedure computes a mathematical function called Armani's function:
#+begin_src scheme
  (define (A x y)
    (cond ((= y 0) 0)
          ((= x 0) (* 2 y))
          ((= y 1) 2)
          (else (A (- x 1)
                   (A x (- y 1))))))
(A 2 4)
#+end_src

#+RESULTS:
: 65536

What are the values of the following expressions?
#+begin_src scheme
(A 1 10)
(A 0 (A 1 9))
(A 0 (A 0 (A 1 8)))
(A 0 (A 0 (A 0 (A 1 7))))
;; ... 2 * 2 * 2 * ...
;; 2^10

(A 2 4)
(A 1 (A 2 3))
(A 1 (A 1 (A 2 2)))
(A 1 (A 1 (A 1 (A 2 1))))
(A 1 (A 1 (A 1 2)))
(A 1 (A 1 (A 0 (A 1 1))))
(A 1 (A 1 (A 0 2)))
(A 1 (A 1 4))
(A 1 (A 0 (A 1 3)))
(A 1 (A 0 8))
(A 1 16)
;; 2^16 = 2^{2^{4}}

(A 3 3)
;; 2^{2^{2^3}}
#+end_src

Consider the following procedures, where A is the procedure defined above:
#+begin_src scheme
(define (f n) (A 0 n)) ;; 2n

(define (g n) (A 1 n)) ;; 2^n

(define (h n) (A 2 n)) ;; 2^{2^n}

(define (k n) (* 5 n n))
#+end_src

Give concise mathematical definitions for the functions computed by the procedures ~f~, ~g~, and ~h~
for positive integer values of $n$. For example, ~(k, n)~ computes $5n^2$.
** 1.11
A function $f$ is defined as follows:

$$
f(n) = \begin{cases}
n &\text{if } n < 3\\
f(n-1) + 2f(n-2) + 3f(n-3) &\text{if } n \geq 3
\end{cases}
$$

Write a procedure that computes $f$ by means of an iterative process.
#+begin_src scheme
  (define (f n)
    (cond ((< n 3) n)
          (else (f-iter 1 2 3 (- n 3)))))

  (define (f-iter 1st 2ec 3rd count)
    (cond ((= count 0) 3rd)
          (else (f-iter 2ec
                        3rd
                        (+ (* 3 1st)
                           (* 2 2ec)
                           3rd)
                        (- count 1)))))

(f 7)
;; 1 2 3 10 (10+6+6)=22 
#+end_src

#+RESULTS:
: 22
** 1.12
The following pattern of numbers is Pascal's triangle.

\begin{tabular}{>{$n=}l<{$\hspace{12pt}}*{13}{c}}
0 &&&&&&&1&&&&&&\\
1 &&&&&&1&&1&&&&&\\
2 &&&&&1&&2&&1&&&&\\
3 &&&&1&&3&&3&&1&&&\\
4 &&&1&&4&&6&&4&&1&&\\
5 &&1&&5&&10&&10&&5&&1&\\
6 &1&&6&&15&&20&&15&&6&&1
\end{tabular}

Write a procedure that computes elements of Pascal's triangle by means of a recursive  process.

To accomplish this, let's first get a tabular form of the triangle in left-most alignment:

\begin{tabular}{>{$}l<{$}|*{7}{c}}
\multicolumn{1}{l}{$k$} &&&&&&&\\\cline{1-1} 
0 &1&&&&&&\\
1 &1&1&&&&&\\
2 &1&2&1&&&&\\
3 &1&3&3&1&&&\\
4 &1&4&6&4&1&&\\
5 &1&5&10&10&5&1&\\
6 &1&6&15&20&15&6&1\\\hline
\multicolumn{1}{l}{} &0&1&2&3&4&5&6\\\cline{2-8}
\multicolumn{1}{l}{} &\multicolumn{7}{c}{$i$}
\end{tabular}

The goal is to write a recursive procedure ~(pas-tri r c)~ that gives the number located at the
$r$ row and $c$ column in the Pascal's triangle.
#+begin_src scheme
  ;; notice that there are special cases
  ;; 1. at the edge
  ;; 2. at the top
  (define (pas-tri r c)
    (cond ((or (= r c)
               (= c 0))
           1)
          (else (+ (pas-tri (- r 1) ;; the line above
                            (- c 1));; the column to the left
                   (pas-tri (- r 1) ;; the line above
                            c)))))  ;; the same column
(pas-tri 6 4)
#+end_src

#+RESULTS:
: 15

** 1.16
Design a procedure that evolves an *iterative* exponentiation process that uses successive
squaring and uses a logarithmic number of steps, as does ~fast-expt~.
Hint: use the observation that $(b^{n/2})^2 = (b^2)^{n/2}$, keep, along with the exponent $n$
and the base $b$, an additional state variable $a$, and define the state transformation in 
such a way that the product $ab^n$ is unchanged from state to state.
At the beginning of the process $a$ is taken to be 1, and the answer is given by the value 
of $a$ at the end of the process.
In general, the technique of defining an **invariant quantity** that remains unchanged from state
to state is a powerful way to think about the design of iterative algorithms.

IDEA: Iteratively, take the exponent inside and replace old base with new ones, until outer 
exponent is 1.
When the outer exponent left is even, further the process by making $a\Leftarrow a^2$ and 
thus shrink the exponent by dividing it by 2.
When the outer exponent is odd, take 1 away and make $a\Leftarrow ab$, shrink the exponent by 1.

The above idea is terribly wrong! Because the case for dealing with odd exponent is problematic.
The "1" taken out is not on the base of $b$, but rather on the base of what is inside right now.
Can we put another variable that hold what's outside?
#+begin_src scheme
  (define (expt b n) ;; expect b and n both to be integers.
    (expt-iter b n b 1))

  ;; outer is for keep track of what is outside.
  (define (expt-iter b cnt a outer)
    (cond ((= cnt 0) 1)
          ((= cnt 1) (* a outer))
          ((even? cnt) (expt-iter b
                                  (/ cnt 2)  ;; divide the outside expo by 2
                                  (square a) ;; double the inside
                                  outer))    ;; outside additional remains the same
          (else (expt-iter b
                           (- cnt 1)         ;; minus 1 to make it even
                           a                 ;; inside remains the same
                           (* outer a)))))   ;; outer additional get multiplied by the base

  (define (even? x)
    (= (remainder x 2) 0))

  (define (square x) (* x x))

(expt 2 19)
#+end_src

#+RESULTS:
: 524288

This solution I have here does not follow the hint given in the book. I haven't figured out how 
to compute it with an /invariant quantity/.
** 1.18
Using the results of exercises 1.16 and 1.17, devise a procedure that generates an iterative process
for multiplying two integers in terms of adding, doubling, and halving and uses a logarithmic number
of steps.
#+begin_src scheme
  (define (double x) (+ x x))
  (define (halve x) (/ x 2))
  (define (even? x) (= (remainder x 2) 0))

  (define (fast-mul a b)
    (mul-iter a b 0))

  (define (mul-iter a b add)
    (cond ((= b 0) 0)
          ((= b 1) (+ a add))
          ((even? b) (mul-iter (double a)
                               (halve b) ;; logarithmic
                               add))
          (else (mul-iter a
                          (- b 1)
                          (+ add a)))))  ;; carry the information along, makes it an iterative process
(fast-mul 23 59)
#+end_src

#+RESULTS:
: 1357

** 1.19
There is a clever algorithm for computing the Fibonacci numbers in logarithmic
numbers of steps. Recall the transformation of the state variables $a$ and $b$
in the ~fib-iter~ process of section 1.2.2:
 
\begin{align*}
a &\leftarrow a + b\\
b &\leftarrow a
\end{align*}

Call this transformation $T$, and observe that applying $T$ over and over again
$n$ times, starting with 1 and 0, produces the pair $Fib(n+1)$ and $Fib(n)$.
In other words, the Fibonacci numbers are produced by $T^n$, the $n$th power
or the transformation $T$, starting with the pair $(1,0)$.

Now consider the $T$ to be the special case of $p = 0$ and $q = 1$ in a family
of transformations $T_{pq}$, where $T_{pq}$ transforms the pair $(a,b)$ according
to:

\begin{align*}
a &\leftarrow bq + aq + ap \\
b &\leftarrow bp + aq
\end{align*}

Show that if we apply such transformation $T_{pq}$ twice, the effect is the same
as using a single transformation $T_{p^\prime q^\prime}$ of the same form, and compute $p^\prime$
and $q^\prime$ in terms of $p$ and $q$.

This gives us an explicit way to square these transformations, and thus we can
compute $T^n$ using successive squaring, as in the ~fast-expt~ procedure. Put
this all together to complete the following procedure, which runs in a logarithmic 
number of steps:

#+begin_src scheme
  (define (fib n)
    (fib-iter 1 0 0 1 n))

  (define (fib-iter a b p q count)
    (cond ((= count 0) b)
          ((even? count)
           (fib-iter a
                     b
                     (+ (square p) (square q))
                     (+ (square q) (* 2 p q))
                     (/ count 2)))
          (else (fib-iter (+ (* b q) (* a q) (* a p))
                          (+ (* b p) (* a q))
                          p
                          q
                          (- count 1)))))

  (define (even? x) (= (remainder x 2) 0))
  (define (square x) (* x x))

(fib 13)
#+end_src

#+RESULTS:
: 233



